MAIN_KEYBOARD_MESSAGE = "🔸 Главное меню"
HELLO_MESSAGE = "👋 Здравствуйте!"
FAQ_MESSAGE = "🚲 Велосипед — онлайн‑магазин с доставкой за 15 минут. Приносим продукты, товары для дома, косметику и всё нужное для комфортного быта. В каждом районе есть свой даркстор, поэтому так быстро. Доставка всегда бесплатная. 🏠"


REJECT_BUTTON = "❌ Отмена"
ACTION_REJECTED = "❌ Действие отменено!"

CATALOG_BUTTON = "📖 Каталог"
CART_BUTTON = "🛒 Корзина"
FAQ_BUTTON = "ℹ️ FAQ"
SUPPORT_BUTTON = "🙍‍♂️ Поддержка"

CHOICE_CATEGORY = "📖 Выберите категорию:"

PRODUCT_TEXT = """<b>Категория:</b> {CATEGORY}

<b>{NAME}</b>

{DESCRIPTION}

<b>Стоимость:</b> {PRICE} руб."""

IN_CART_BUTTON = "🛒 В корзине: {PRICE} x {AMOUNT} = {ALL_PRICE} руб."
PLUS_EMOJI = "➕"
MINUS_EMOJI = "➖"
LEFT_EMOJI = "⬅️"
RIGHT_EMOJI = "➡️"

RETURN_BUTTON = "↩️ Назад"

SUPPORT_TEXT = """🙍‍♂️ Поддержка

bicycle@petrsed.ru"""

ITEM_CART_BUTTON = "{ITEM}: {PRICE} x {AMOUNT} = {ALL_PRICE} руб."

CART_TEXT = "🛒 Корзина:"
ALL_AMOUNT_TEXT = "Итого: {ALL_AMOUNT} руб."

START_ORDER = "Оформить заказ"

ENTER_ADDRESS_TEXT = "🏠 Введите адрес:"

RECEIPT_TEXT = """<b>🛒 Оплата:</b>

{PRODCUTS}

<b>Итого:</b> {AMOUNT} руб.

<b>Оплатите продукты по ссылке ниже и нажмите на кнопку 'Проверить платёж'</b>
"""

PAY_BUTTON = "💳 Оплатить"
CHECK_PAY_BUTTON = "✅ Проверить платёж"

PAY_NOT_FOUND = "❌ Платёж не найден"
ORDER_CREATED = "✅ Заказ создан. Ожидайте курьера!"

NEW_ORDER_NOTICE = """🛒 Новый заказ:

ID пользователя - {ID}
Логин пользователя - @{LOGIN}
Адрес - {ADDRESS}

Корзина:
{PRODCUTS}

Итого: {AMOUNT} руб."""